espressif/esp-matter/examples/door_lock/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3-DevKitC-1 Settings
# Buttons
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0
# LEDs
CONFIG_BSP_LEDS_NUM=1
CONFIG_BSP_LED_TYPE_RGB=y
CONFIG_BSP_LED_RGB_GPIO=38
CONFIG_BSP_LED_RGB_BACKEND_RMT=y
